Tekla.Structures.DrawingInternal.ReturnValuesEnum
Database operation return values. These must be identical to #define's in TS-code.
int_gr_dotnet_types.hpp

Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_OPERATION_OK


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_OPERATION_FAILED


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_ERROR_ILLEGAL_QUERYTYPE


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_ERROR_NUMBERING_NOT_UPTODATE


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_ERROR_DRAWING_EDITOR_MUST_BE_CLOSED


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_ERROR_DRAWING_IS_ACTIVE


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_ERROR_ILLEGAL_VIEW_TYPE


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_ERROR_INVALID_PICKER_INPUT


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_DRAWING_NOT_UPTODATE


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_DRAWING_CANNOT_MODIFY
We currently (031008) don't support modifying
a drawing that is not currently active.

Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_DRAWING_CANNOT_DELETE_ACTIVE
Active drawing cannot be deleted.

Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_DRAWING_CANNOT_INSERT
Drawing cannot be inserted when another drawing is active.

Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_OPERATION_NOT_SUPPORTED


Tekla.Structures.DrawingInternal.ReturnValuesEnum.DOT_GR_ERROR_INVALID_ATTRIBUTES_GIVEN
